ss命令用来显示处于活动状态的套接字信息。ss命令可以用来获取socket统计信息，它可以显示和netstat类似的内容。但ss的优势在于它能够显示更多更详细的有关TCP和连接状态的信息，而且比netstat更快速更高效。
当服务器的socket连接数量变得非常大时，无论是使用netstat还是直接cat /proc/net/tcp，执行速度都会很慢。当服务器维持连接达到上万个时，使用netstat就等于浪费生命，而用ss才是节省时间。
ss快的原因在于，ss利用到了TCP协议栈中tcp_diag。tcp_diag是一个用于分析统计的模块，可以获得Linux内核中第一手的信息，这就确保了ss的快速高效。

语法：
	ss（选项）

选项：
	-h：显示帮助信息
	-V：显示指令版本信息
	-n：不解析服务名称，以数字方式显示
	-a：显示所有的套接字
	-l：显示处于监听状态的套接字
	-o：显示计时器
	-m：显示套接字的内存使用情况
	-p：显示使用套接字的进程信息
	-i：显示内部的TCP信息
	-4：只显示ipv4的套接字
	-6：只显示ipv6的套接字
	-t：只显示tcp套接字
	-u：只显示udp套接字
	-d：只显示DCCP套接字
	-w：仅显示RAW套接字
	-x：仅显示UNIX域套接字
